common/models/User.php

SELECT * FROM `user` WHERE `access_token`='Z1XBuqn3988u8tUMx4XE_7b1BaGwDrn5fhjvaBnWartd2l9ffrGGd60SpLA43WXJ'
---
    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['access_token' => $token]);