api/controllers/SiteController.php

UPDATE `user` SET `access_token`='nJDBQe9uYcKcztuKobY8scfFTVQhJTCIewdXJ0j4mPBTtPO2C1h8NTcsSrD-FKzx', `updated_at`=1678182245 WHERE `id`=1
---
    public function actionLogin()
    {
        $model = new LoginForm();
        if($model->load(Yii::$app->request->post(),'')){
            if($model->login()){
                $user= $model->getUser();
                $user->access_token = Yii::$app->security->generateRandomString(64);
                $user->save();